Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: You can add a whole list of these. Add one each time you discover a common mistake.
es_es: Puede crear una lista completa de ejemplos como este. Añada uno cada vez que descubra un error común.

source: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Jack Benny i ad advertisement ! teh the
es_es: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Juan Benítez i po policía ! qeu que

source: The "i" in the first column indicates Insert mode. These abbreviations are only active in Insert mode. Other possible characters are:
es_es: La «i» en la primera columna indica modo Insertar. Estas abreviaturas sólo están activas en el modo Insertar. Otros caracteres posibles son:

source: Since abbreviations are not often useful in Command-line mode, you will mostly use the ":iabbrev" command. That avoids, for example, that "ad" gets expanded when typing a command like: >
es_es: Debido a que las abreviaturas no son útiles en el modo Línea de órdenes, usará más regularmente la orden «:iabbrev». Esto evita, por ejemplo, que se expanda «po» al escribir una orden como: >

source: :edit ad
es_es: :edit po

source: To get rid of an abbreviation, use the ":unabbreviate" command. Suppose you have the following abbreviation: >
es_es: Para eliminar una abreviatura, use la orden «:unabbreviate». Suponga que tiene la siguiente abreviatura: >

source: :abbreviate @f fresh
es_es: :abbreviate @f fresco

source: While you type this, you will notice that @f is expanded to "fresh". Don't worry about this, Vim understands it anyway (except when you have an abbreviation for "fresh", but that's very unlikely). To remove all the abbreviations: >
es_es: Notará al escribir esto que @f se expande a «fresco». No se preocupe, Vim lo entiende de todas formas (a menos que tenga una abreviatura «fresco», pero eso es improbable). Para eliminar todas las abreviaturas: >

source: There is one thing to watch out for when defining an abbreviation: The resulting string should not be mapped. For example: >
es_es: Existe un aspecto a tener en cuenta a la hora de definir una abreviatura: no debería asignar la cadena resultante a una macro. Por ejemplo: >

source: When you now type @a, you will get "adisk-doorer". That's not what you want. To avoid this, use the ":noreabbrev" command. It does the same as ":abbreviate", but avoids that the resulting string is used for mappings: >
es_es: Si ahora teclea @a, obtendrá «adisk-doorer». Esto no es lo que quiere. Para evitarlo, use la orden «:noabbrev». Hace lo mismo que «:abbreviate», pero evita que la cadena resultante se use en macros.

source: *24.8* Entering special characters
es_es: *24.8* Introducir caracteres especiales

source: The CTRL-V command is used to insert the next character literally. In other words, any special meaning the character has, it will be ignored. For example: >
es_es: La orden CTRL-V se emplea para insertar el siguiente carácter de forma literal. En otras palabras, se ignorará el significado especial de cualquier carácter. Por ejemplo: >

source: Inserts an escape character. Thus you don't leave Insert mode. (Don't type the space after CTRL-V, it's only to make this easier to read).
es_es: Esta orden inserta un carácter de escapado. Por ello, no abandona el modo Insertar. (No escriba un espacio después de CTRL-V, sólo lo hace más fácil de leer).

source: Note: On MS-Windows CTRL-V is used to paste text. Use CTRL-Q instead of CTRL-V. On Unix, on the other hand, CTRL-Q does not work on some terminals, because it has a special meaning.
es_es: Nota: En MS-Windows, CTRL-V se emplea para pegar texto. Use CTRL-Q en lugar de CTRL-V. Por otra parte, Unix no reconoce CTRL-Q en algunas terminales, porque tiene un significado especial.

source: You can also use the command CTRL-V {digits} to insert a character with the decimal number {digits}. For example, the character number 127 is the <Del> character (but not necessarily the <Del> key!). To insert <Del> type: >
es_es: También puede usar la orden CTRL-V {dígitos} para insertar un carácter con el número decimal {dígitos}. Por ejemplo, el carácter número 127 es el carácter <Del> (Supr) (¡pero no necesariamente la tecla <Supr>!). Escriba lo siguiente para insetar <Del>.

source: You can enter characters up to 255 this way. When you type fewer than two digits, a non-digit will terminate the command. To avoid the need of typing a non-digit, prepend one or two zeros to make three digits. All the next commands insert a <Tab> and then a dot:
es_es: Puede introducir hasta el carácter 255 de esta manera. Cuando escribe menos de dos dígitos, un no-dígito finalizará la orden. Para evitar la necesidad de escribir un no-dígito, añada uno o dos ceros para sumar tres dígitos. Todas las ordenes a continuación insertan primero un <Tab> y después un punto:

source: This also goes up to character 255 (CTRL-V xff). You can use "o" to type a character as an octal number and two more methods allow you to type up to a 16 bit and a 32 bit number (e.g., for a Unicode character): >
es_es: Esto también llega al carácter 255 (CTRL-V xff). También puede usar «o» para escribir un carácter como un número octal, y otros dos métodos le permiten escribir hasta un número en 16 y 32 bit (p, ej., un carácter Unicode): >

source: *24.9* Digraphs
es_es: *24.9* Dígrafos

source: Vim will display the digraph table. Here are three lines of it:
es_es: Vim mostrará la tabla de dígrafos. Aquí puede ver tres líneas:

source: Note: The digraphs depend on the character set that Vim assumes you are using. On MS-DOS they are different from MS-Windows. Always use ":digraphs" to find out which digraphs are currently available.
es_es: Nota: Los dígrafos dependen del juego de caracteres que Vim asume que está usando. En MS-DOS difieren con los de MS-Windows. Use siempre «:digraphs» para ver de qué dígrafos dispone.

source: You can define your own digraphs. Example: >
es_es: Puede configurar sus propios dígrafos. Ejemplo: >

source: More information about digraphs here: |digraphs| Another way to insert special characters is with a keymap. More about that here: |45.5|
es_es: Para más información acerca de los dígrafos, consulte: |digraphs| Otra manera de insertar caracteres especiales es un «keymap». Puede leer más acerca de esto aquí: |45.5|

source: *24.10* Normal mode commands
es_es: *24.10* Órdenes del modo Normal

source: Insert mode offers a limited number of commands. In Normal mode you have many more. When you want to use one, you usually leave Insert mode with <Esc>, execute the Normal mode command, and re-enter Insert mode with "i" or "a". There is a quicker way. With CTRL-O {command} you can execute any Normal mode command from Insert mode. For example, to delete from the cursor to the end of the line: >
es_es: El modo Insertar ofrece un limitado número de órdenes. Dispone de muchas más en el modo normal. Si desea usar uno, abandone el modo Insertar con <Esc>, ejecuto la orden en modo Normal, y vuelva al modo Insertar con «i» o «a». Hay una manera más rápida. Con CTRL-O {orden} puede ejecutar cualquier orden de modo Normal en el modo Insertar. Por ejemplo, para eliminar desde el cursor hasta el final de la línea: >

source: You can execute only one Normal mode command this way. But you can specify a register or a count. A more complicated example: >
es_es: Sólo puede ejecutar una orden de modo Normal de esta manera. Pero puede especificar un registro o cuenta. Aquí tiene una manera más complicada: >

source: *usr_10.txt* For Vim version 7.3.
es_es: *usr_10.esx* Para Vim versión 7.3.

source: Last change: 2006 Nov 05
es_es: Último cambio: 5/11/2006

source: In chapter 4 several ways to make small changes were explained.
es_es: En el capítulo 4 se explicaron algunas formas de hacer cambios pequeños.

source: This chapter goes into making changes that are repeated or can affect a large amount of text.
es_es: Este capítulo tratará de cambios que se repiten o que afectan a grandes porciones del texto.

source: The Visual mode allows doing various things with blocks of text.
es_es: El modo Visual permite hacer varias cosas con bloques de texto.

source: Use an external program to do really complicated things.
es_es: Use un programa externo para hacer las cosas más complicadas.

source: The "." command repeats the preceding change.
es_es: La orden «.» repite el cambio precedente.

source: But what if you want to do something more complex than a single change?
es_es: ¿Pero qué ocurre si quiere hacer algo más complicado que un simple cambio?

source: That's where command recording comes in.
es_es: Para eso tenemos la orden de grabación («:recording»).

source: There are three steps:
es_es: Hay que seguir tres pasos:

source: The "q{register}" command starts recording keystrokes into the register named {register}.
es_es: La orden «q{registro}» inicia la grabación de teclas pulsadas en un registro llamado{registro}.

source: The register name must be between a and z. 2.
es_es: El nombre del registro debe estar en el rango (a-z). 2.

source: Type your commands. 3.
es_es: Introduzca sus órdenes. 3.

source: To finish recording, press q (without any extra character).
es_es: Pulse q para detener la grabación (sin ningún carácter adicional).

source: Take a look at how to use these commands in practice.
es_es: Vamos a echarle un vistazo a cómo se usan las órdenes en la práctica.

source: You have a list of filenames that look like this:
es_es: Tiene una lista de nombres de archivo como esta:

source: You start by moving to the first character of the first line.
es_es: Comienza desplazándose al primer carácter de la primera línea.

source: Next you execute the following commands:
es_es: A continuación ejecute la siguiente orden:

source: qa Start recording a macro in register a.
es_es: qa Comenzar a grabar la macro en el registro «a».

source: ^ Move to the beginning of the line.
es_es: ^ Ir al comienzo de la línea.

source: i#include "<Esc> Insert the string #include " at the beginning of the line.
es_es: i#include "<Esc> Insertar el #include " al comienzo de cada línea.

source: $ Move to the end of the line.
es_es: $ Ir al final de la línea.

source: a"<Esc> Append the character double quotation mark (") to the end of the line.
es_es: a"<Esc> Añadir el carácter de comillas dobles (") al final de la línea.

source: j Go to the next line.
es_es: j Ir a la próxima línea.

source: q Stop recording the macro.
es_es: q Detener la grabación de la macro.

source: Now that you have done the work once, you can repeat the change by typing the command "@a" three times.
es_es: Ahora que ha realizado el trabajo una vez, puede repetir el cambio tecleando la orden «@a» tres veces.

source: The "@a" command can be preceded by a count, which will cause the macro to be executed that number of times.
es_es: La orden «@a» puede venir precedido de un multiplicador, el cuál causará que la macro se ejecute ese número determinado de veces.

source: In this case you would type: >
es_es: En este caso: >

source: You might have the lines you want to change in various places.
es_es: Tal vez tenga las líneas que quiere cambiar en varios lugares.

source: Just move the cursor to each location and use the "@a" command.
es_es: Simplemente mueva el cursor a cada ubicación y use la orden «@a».

source: If you have done that once, you can do it again with "@@".
es_es: Si ha hecho eso una vez, puede repetirlo con «@@».

source: That's a bit easier to type.
es_es: Es un poco más sencillo de teclear.

source: If you now execute register b with "@b", the next "@@" will use register b.
es_es: Si ejecuta el registro b con «@b», el próximo «@@» usará el registro b.

source: If you compare the playback method with using ".", there are several differences.
es_es: Si compara esto con el método «.», hay varias diferencias.

source: First of all, "." can only repeat one change.
es_es: Lo primero, «.x sólo puede repetir un cambio.

source: As seen in the example above, "@a" can do several changes, and move around as well.
es_es: Como ha podido ver en el ejemplo de arriba, «@a» puede llevar a cabo varios cambios, incluyendo movimientos.

source: Secondly, "." can only remember the last change.
es_es: Por otro lado, «.» sólo puede recordar el último cambio.

source: Executing a register allows you to make any changes and then still use "@a" to replay the recorded commands.
es_es: Ejecutar un registro le permite hacer algunos cambios en el texto y poder usar todavía las órdenes grabadas.

source: Finally, you can use 26 different registers.
es_es: Por último, puede usar 26 registros distintos.

source: Thus you can remember 26 different command sequences to execute.
es_es: De este modo puede reusar 26 secuencias diferentes.

source: The registers used for recording are the same ones you used for yank and delete commands.
es_es: Los registros que se usan para grabar son los mismos que se usan para las órdenes de copiar y eliminar.

source: This allows you to mix recording with other commands to manipulate the registers.
es_es: Esto le permite mezclar la grabación con otras órdenes para manipular los registros.

source: Suppose you have recorded a few commands in register n.
es_es: Suponga que ha grabado algunas órdenes en el registro n.

source: When you execute this with "@n" you notice you did something wrong.
es_es: Cuando lo ejecuta con «@n», se da cuenta de que algo no va bien.

source: You could try recording again, but perhaps you will make another mistake.
es_es: Podría intentar grabarlo de nuevo, pero quizá cometa otro error.

source: Instead, use this trick:
es_es: Mejor usar este truco:

source: Now you can execute the corrected commands with "@n".
es_es: Ahora puede ejecutar las órdenes corregidas con «@n».

source: (If your recorded commands include line breaks, adjust the last two items in the example to include all the lines.)
es_es: (Si las órdenes grabadas incluyen saltos de línea, ajuste los dos últimos puntos explicados anteriormente para incluir todas las líneas.)

source: So far we have used a lowercase letter for the register name.
es_es: Hasta el momento hemos usado letras en minúscula para el nombre del registro.

source: To append to a register, use an uppercase letter.
es_es: Para añadir a un registro, use una letra en mayúscula.

source: Suppose you have recorded a command to change a word to register c.
es_es: Suponga por un momento que ha grabado una orden para cambiar una palabra en el registro c.

source: It works properly, but you would like to add a search for the next word to change.
es_es: Funciona correctamente, pero quisiera añadir una búsqueda para la siguiente palabra a cambiar.

source: This can be done with: >
es_es: Esto se puede hacer así: >

source: You start with "qC", which records to the c register and appends.
es_es: Comience con «qC», que añadirá al registro c.

source: Thus writing to an uppercase register name means to append to the register with the same letter, but lowercase.
es_es: De este modo siempre podrá escribir el registro al que quieras añadir nuevos pasos mediante la misma de letra de identificación, pero en mayúscula.

source: This works both with recording and with yank and delete commands.
es_es: Esto funciona tanto grabando como y con las órdenes de copiar y eliminar.

source: For example, you want to collect a sequence of lines into the a register.
es_es: Por ejemplo, quieres reunir una secuencia de líneas en un registro.

source: Yank the first line with: >
es_es: Copie la primera línea con: >

source: Repeat this command for all lines.
es_es: Repita la orden para todas las líneas.

source: The a register now contains all those lines, in the order you yanked them.
es_es: El registro «a» contiene ahora todas estas líneas, en el orden en el que las ha copiado.

source: The ":substitute" command enables you to perform string replacements on a whole range of lines.
es_es: La orden «:substitute» le permite ejecutar sustituciones de cadenas de caracteres en un rango de líneas.

source: The general form of this command is as follows: >
es_es: La forma general es la siguiente: >

source: This command changes the "from" string to the "to" string in the lines specified with [range].
es_es: Esta orden cambia la cadena «de» por la cadena «a» en las líneas especificadas con [rango].

source: For example, you can change "Professor" to "Teacher" in all lines with the following command: >
es_es: Por ejemplo, puede cambiar «profesor» por «maestro» en todas las líneas con la siguiente orden: >

source: :%substitute/Professor/Teacher/ < Note: The ":substitute" command is almost never spelled out completely.
es_es: :%substitute/profesor/maestro/ < Nota: La orden «:substitute» casi nunca se escribe completamente.

source: Most of the time, people use the abbreviated version ":s".
es_es: La mayoría de las veces la gente escribe la versión abreviada ":s".

source: From here on the abbreviation will be used.
es_es: A partir de ahora, se empleará la abreviatura.

source: The "%" before the command specifies the command works on all lines.
es_es: El «%» antes de la orden especifica que se ejecuta en todas las líneas.

source: Without a range, ":s" only works on the current line.
es_es: Sin rango, «:s» sólo funciona en la línea actual.

source: More about ranges in the next section |10.3|.
es_es: Más sobre los rangos en la próxima sección |10.3|.

source: By default, the ":substitute" command changes only the first occurrence on each line.
es_es: Por omisión, la orden «:substitute» cambia sólo la primera palabra encontrada en cada línea.

source: For example, the preceding command changes the line:
es_es: Por ejemplo, la orden anterior cambia esta línea:

source: Professor Smith criticized Professor Johnson today.
es_es: El profesor Pinilla ha criticado hoy al profesor Burgos.

source: Teacher Smith criticized Professor Johnson today.
es_es: El maestro Pinilla ha criticado hoy al profesor Burgos.

source: To change every occurrence on the line, you need to add the g (global) flag.
es_es: Para cambiar todas palabras que aparezcan en la línea deberá usar la opción g (global).

source: Teacher Smith criticized Teacher Johnson today.
es_es: El maestro Pinilla ha criticado hoy al maestro Burgos.

source: Other flags include p (print), which causes the ":substitute" command to print out the last line it changes.
es_es: Otras opciones incluyen p (print = imprimir), que hace la orden «:s» muestre en pantalla la última línea que cambió.

source: The c (confirm) flag tells ":substitute" to ask you for confirmation before it performs each substitution.
es_es: La «c» (confirm = confirmar) le dice a «:s» que pida confirmación antes que se ejecute cada sustitución.

source: Enter the following: >
es_es: Introduzca lo siguiente: >

source: Vim finds the first occurrence of "Professor" and displays the text it is about to change.
es_es: Vim encuentra la primera aparición de «profesor» y muestra el texto que está a punto de cambiar.

source: You get the following prompt: >
es_es: Le aparecerá la siguiente pregunta: >

source: y Yes; make this change.
es_es: y Si; hacer el cambio.

source: n No; skip this match.
es_es: n No; omitir esta coincidenci.

source: a All; make this change and all remaining ones without further confirmation.
es_es: a Todo; hacer este cambio y todos los restantes sin pedir más confirmación.

source: q Quit; don't make any more changes.
es_es: q Quit; no hacer más cambios.

source: l Last; make this change and then quit.
es_es: l Último; hacer este cambio y salir.

source: CTRL-E Scroll the text one line up.
es_es: CTRL-E Desplazar el texto hacia arriba.

source: CTRL-Y Scroll the text one line down.
es_es: CTRL-Y Desplazar el texto hacia abajo.

source: If you are substituting with a "from" or "to" part that includes a slash, you need to put a backslash before it.
es_es: Si sustituye con una parte «de» o «a» que incluyan una barra inclinada, tendrá que poner una barra inversa antes de él.

source: A simpler way is to use another character instead of the slash.
es_es: Una forma más sencilla es usar otro carácter como separador en lugar de la barra.

source: A plus, for example: >
es_es: Un «+», por ejemplo: >

source: The ":substitute" command, and many other : commands, can be applied to a selection of lines.
es_es: La orden «:substitute» y muchas otras órdenes «:» se pueden aplicar a una selección de líneas.

source: This is called a range.
es_es: A esto se le llama rango.

source: The simple form of a range is {number},{number}.
es_es: La forma más simple de un rango es {n},{n} (n es un número entero).

source: Executes the substitute command on the lines 1 to 5.
es_es: Ejecuta la orden sustituir desde la línea 1 a la 5.

source: Line 5 is included.
es_es: La línea 5 queda incluida.

source: The range is always placed before the command.
es_es: El rango se sitúa justo antes de la orden.

source: Some commands work on the whole file when you do not specify a range.
es_es: Algunas órdenes funcionan sobre un archivo completo cuando no le especifica un rango.

source: To make them work on the current line the "." address is used.
es_es: Para hacerlos funcionar en la línea actual, use «.».

source: The ":write" command works like that.
es_es: La orden «:write» funciona de ese modo.

source: Without a range, it writes the whole file.
es_es: Sin un rango, escribe el archivo completo.

source: To make it write only the current line into a file: >
es_es: Para hacer que sólo escriba una línea a un archivo: >

source: The first line always has number one.
es_es: La primera línea siempre tiene como numeración el 1.

source: How about the last line?
es_es: ¿Pero qué ocurre con la última línea?

source: The "$" character is used for this.
es_es: Puede usar el carácter «$» ppara esto.

source: For example, to substitute in the lines from the cursor to the end: >
es_es: Por ejemplo, para sustituir en las líneas desde la del cursor hasta el final: >

source: Suppose you are editing a chapter in a book, and want to replace all occurrences of "grey" with "gray".
es_es: Suponga que está editado un capítulo de un libro y que desea reemplazar todas las palabras «grisx con «blanco».

source: But only in this chapter, not in the next one.
es_es: Pero sólo en ese capítulo, no en el siguiente.

source: You know that only chapter boundaries have the word "Chapter" in the first column.
es_es: Sabe que los límites entre capítulos tienen la palabra «Capítulo» en la primera columna.

source: This command will work then: >
es_es: Esta orden funcionaría aquí: >

source: You can see a search pattern is used twice.
es_es: Puede observar que un patrón se ha usado en dos ocasiones.

source: The first "?^Chapter?" finds the line above the current position that matches this pattern.
es_es: La primera «?^Chapter?» busca el patrón en sentido inverso.

source: Thus the ?pattern? range is used to search backwards.
es_es: Por lo tanto «?patrón?» buscará encima de la línea actual.

source: Similarly, "/^Chapter/" is used to search forward for the start of the next chapter.
es_es: De forma similar, «/^Capítulo/» se usa para buscar hacia delante el comienzo del nuevo capítulo.

source: To avoid confusion with the slashes, the "=" character was used in the substitute command here.
es_es: Para evitar confusión con las barras, el carácter «=» se ha empleado en la orden sustituir.

source: A slash or another character would have worked as well.
es_es: Una barra o cualquier otro carácter habría funcionado igual de bien.
